---
kind: property
id: P:Autodesk.Revit.DB.FilterIntegerRule.RuleValue
source: html/71d8572e-a333-3111-b5bf-c5d18304d2c4.htm
---
# Autodesk.Revit.DB.FilterIntegerRule.RuleValue Property

The user-supplied value against which values from a Revit document will be tested.

## Syntax (C#)
```csharp
public int RuleValue { get; set; }
```